In [1]:
import pandas as pd

In [7]:
df1 = pd.DataFrame({'name': ['Marc', 'Jake', 'Sam', 'Brad']})
df2 = pd.DataFrame({'IDs': ['Jake', 'John', 'Marc', 'Tony', 'Bob']})

In [8]:
df1

   name
0  Marc
1  Jake
2   Sam
3  Brad

In [9]:
df2

    IDs
0  Jake
1  John
2  Marc
3  Tony
4   Bob

In [12]:
pd.merge(df1, df2, left_on='name', right_on='IDs', how='inner')

   name   IDs
0  Marc  Marc
1  Jake  Jake